app/controllers/customer_controller.rb

  def index_customer
    @products = Product.all.where(:status=>"on")
---
SELECT "products".* FROM "products" WHERE "products"."status" = ?  [["status", "on"]]

  def productos_categoria
    @products = Product.all.where(:category_id=>params[:id_categoria])
---
SELECT "products".* FROM "products" WHERE "products"."category_id" = ?  [["category_id", 0]]

  def details_product
    @product = Product.find(params[:id])
    @product_colors = Product.find(params[:id]).colorProducts
    @product_sizes = Product.find(params[:id]).sizeProducts
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
SELECT "color_products".* FROM "color_products" WHERE "color_products"."product_id" = ?  [["product_id", 4]]
SELECT "colors".* FROM "colors" WHERE "colors"."id" = ? LIMIT ?  [["id", 53], ["LIMIT", 1]]
SELECT "sizes".* FROM "sizes" WHERE "sizes"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]

  def productos_desconto
    kids = Category.find(params[:id_categoria]).children
    my_product = Product.all.where(:category_id=>params[:id_categoria]);
    p = []
    my_product.each do |single|
      p.push(single)
    end

    kids.each do |k|
        p2 =Product.where("category_id = ? AND price_current<price",k.id)
        p2.each do |single|
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."category_id" = ?  [["category_id", 1]]
SELECT "products".* FROM "products" WHERE (category_id = 7 AND price_current<price)