app/controllers/products_controller.rb

  def show
    @product_images = @product.product_images.all
---
SELECT "product_images".* FROM "product_images" WHERE "product_images"."product_id" = ?  [["product_id", 18]]
SELECT "size_products".* FROM "size_products" WHERE "size_products"."product_id" = ?  [["product_id", 22]]

  def create

    print params['details[color]']
    @product = Product.new(product_params)
    @root_categories = Category.roots
    if @product.save
      respond_to do |format|
        if @product.save
          (params[:product_images]['image']).each do |img|
            @product_images = @product.product_images.create!(:image => img,:product_id => @product.id)
           end

           (params[:detail]['color']).each do |c|
            @product_colors = ColorProduct.create!(:product_id => @product.id, :color_id => c)
           end

           (params[:detail]['size']).each do |s|
            @product_colors = SizeProduct.create!(:product_id => @product.id, :size_id => s)
---
INSERT INTO "products" ("category_id", "title", "status", "price_current", "price", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "product_images" ("product_id", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?)  [["product_id", 23], ["created_at", "2021-06-11 02:21:58.327945"], ["updated_at", "2021-06-11 02:21:58.327945"], ["image", "Captura_de_ecrã_2020-12-11__às_10.56.04.png"]]
SELECT "colors".* FROM "colors"
INSERT INTO "color_products" ("color_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["color_id", 53], ["product_id", 23], ["created_at", "2021-06-11 02:21:59.573686"], ["updated_at", "2021-06-11 02:21:59.573686"]]
SELECT "sizes".* FROM "sizes"
INSERT INTO "size_products" ("size_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["size_id", 33], ["product_id", 23], ["created_at", "2021-06-11 02:22:01.431740"], ["updated_at", "2021-06-11 02:22:01.431740"]]

  def update
    @root_categories = Category.roots
    respond_to do |format|
      if @product.update(product_params)

      if(params[:product_images]!=nil) then
          @product.product_images.destroy_all

        (params[:product_images]['image']).each do |img|
          @product_images = @product.product_images.create!(:image => img,:product_id => @product.id)
        end

        (params[:detail]['color']).each do |c|
          @product_colors = ColorProduct.create!(:product_id => @product.id, :color_id => c)
         end

        (params[:detail]['size']).each do |s|
          @product_colors = SizeProduct.create!(:product_id => @product.id, :size_id => s)
---
UPDATE "products" SET "category_id" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["category_id", 10], ["updated_at", "2021-06-11 02:33:04.437704"], ["id", 23]]
DELETE FROM "product_images" WHERE "product_images"."id" = ?  [["id", 106]]
SELECT "product_images".* FROM "product_images" WHERE "product_images"."product_id" = ?  [["product_id", 23]]
INSERT INTO "size_products" ("size_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["size_id", 33], ["product_id", 23], ["created_at", "2021-06-11 02:33:14.937835"], ["updated_at", "2021-06-11 02:33:14.937835"]]
INSERT INTO "product_images" ("product_id", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?)  [["product_id", 23], ["created_at", "2021-06-11 02:33:04.474827"], ["updated_at", "2021-06-11 02:33:04.474827"], ["image", "Captura_de_ecrã_2021-03-04__às_22.56.22.png"]]
INSERT INTO "color_products" ("color_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["color_id", 53], ["product_id", 23], ["created_at", "2021-06-11 02:33:14.921708"], ["updated_at", "2021-06-11 02:33:14.921708"]]