app/views/products/show.html.erb

SELECT "size_products".* FROM "size_products" WHERE "size_products"."product_id" = ?  [["product_id", 22]]
SELECT "product_images".* FROM "product_images" WHERE "product_images"."product_id" = ?  [["product_id", 18]]
---
                        <% status =""%>
                      <% @product.product_images.each do |image|%>

SELECT "sizes".* FROM "sizes" WHERE "sizes"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
---
              <%@product_sizes.each do |s| %>
                      <%= s.size.name %>