app/views/customer/_index.html.erb


                                                <img src="<%= product.product_images.first.image %>" class="img-menu" alt="">
                                                <img src="<%= product.product_images.last.image %>" class="img-menu" alt="">
---
SELECT "product_images".* FROM "product_images" WHERE "product_images"."product_id" = ? ORDER BY "product_images"."id" ASC LIMIT ?  [["product_id", 11], ["LIMIT", 1]]
SELECT "product_images".* FROM "product_images" WHERE "product_images"."product_id" = ? ORDER BY "product_images"."id" DESC LIMIT ?  [["product_id", 11], ["LIMIT", 1]]