app/views/customer/details_product.html.erb

SELECT "size_products".* FROM "size_products" WHERE "size_products"."product_id" = ?  [["product_id", 12]]
SELECT "product_images".* FROM "product_images" WHERE "product_images"."product_id" = ? ORDER BY "product_images"."id" DESC LIMIT ?  [["product_id", 23], ["LIMIT", 1]]
---

										<img src="<%= @product.product_images.first.image %>" class="img-fluid" alt="">
										<img src="<%= @product.product_images.last.image %>" class="zoomImg" style="position: absolute; top: 0px; left: 0px; opacity: 0; width: 810px; height: 1080px; border: none; max-width: none; max-height: none;"></div></div></div><div class="slick-slide" data-slick-index="1" aria-hidden="true" tabindex="-1" role="tabpanel" id="slick-slide01" aria-describedby="slick-slide-control01" style="width: 690px;"><div><div class="single-image" style="width: 100%; display: inline-block;">

SELECT "sizes".* FROM "sizes" WHERE "sizes"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
---
											<%@product_sizes.each do |s| %>
												<span class="single-size"><%= s.size.name %></span>